#include <stdio.h>

int main(){
    float score = 90.5f;
    printf("score : %.1f\n", score);
}



//ผลลัพธ์ที่ได้ต่างกันอย่างไร
// กรณีที่1 ใช้ int จะเก็บได้เเค่จำนวนเต็มอย่างเดียว   พอมีทศนิยม ก็จะถูกตัดออกเป็นจำนวนเต็ม 
 // กรณีที่2 ใช้ float จะสามารถเก็บค่าทศนิยมได้ เเละ90.5fคือการบอกค่าชนิดของ fioat 

 //ทำไมต้องเลือก (Data Type) ให้ถูกต้อง
  //เพื่อไม่ให้การทำงานของโปรแกรมผิดพลาดตัวอย่างเช่นให้ตัวแปรเป็นintแต่ใส่ค่าทศนิยมเข้าไปอาจทำให้ค่าที่ออกมาผิดเพี้ยนได้

//อภิปราย และสรุปผลที่ได้จากการทดลอง
  // จะเห็นได้ว่า int จะไม่รับค่าที่เป็นทศนิยม ส่วนfloat จะเก็บค่าทศนิยมได้ หรือก็คือถ้าใช้ Data Type ผิดอาจจะทำให้ค่าไม่ตรงหรือผิดเพี้ยนได้