#include <stdio.h>

void countCall(){
    int counter = 0;
    counter++;
    printf("Call Function: Counter = %d\n", counter);
}

int main(){
    printf("Starting function calls...\n");
    countCall();
    printf("After first call:\n");
    countCall();
    return 0;
}

//ผลลัพธ์ที่ได้ต่างกันอย่างไร
    // กรณีที่ 1 ตัวเลขจะเพิ่มขึ้นจาก1เป็น2 เพราะ static int จะจำค่าก่อนหน้านั้นไว้
    // กรณีที่ 2 ตัวเลขที่ได้จะเป็น 1 เหมือนเดิมทั้งสองครั้ง เพราะ int ปกติจะต้องสร้างใหม่ทุกครั้งที่ใช้ฟังก์ชัน
//ความเเตกต่างของNon-Static Variable
    // Non-ststic จะเริ่มนับใหม่ ทักครั้งที่เรียกใช้ฟังก์ชัน
    // Static จะจำค่าครั้งก่อนหน้าไว้เเม้จะออกจากฟังก์ชันแล้วก็ตาม
//อภิปรายและสรุปผลจากการทดลอง
    // การใช้ static จะเหมาะกับตัวแปรที่เราต้องการให้จำสถานะหรือค่าที่ไว้ข้ามการเรียกใช้ฟังก์ชัน ส่วนตัวแปรแบบธรรมดา(int)จะไม่จำค่าเดิม ทำใหเเริ่มใหม่ทุกครั้ง 